{
  "About": {
  "Name": "Ezana Girmay",
  "Currently": "Computer Science Student",
  "Headshot": "",
  "Thumbnail": "student-logo.webp",
  "AboutText": "Hi, I am Ezana Girmay. I am a passionate computer science student with a keen interest in software development and programming. Currently, I am pursuing my undergraduate degree at Seattle Pacific University. I am dedicated to expanding my knowledge and skills in various areas of computer science, with a particular focus on C++ programming.<br><br>I enjoy tackling challenging programming projects and I thrive in collaborative environments where I can contribute my expertise and learn from my peers.<br><br>Being someone who was born and raised in the greater Seattle area I enjoy spending my free time outdoor and in nature. Some of my hobbies out side the classroom include, exploring the many hiking trails we have here in Washington state. I also enjoy playing sports like tennis and soccer."
},
"Contact": {
  "EMail": "girmaye@spu.edu",
  "Phone": "",
  "Portfolio": "https://www.github.com",
  "LinkedIn": "https://linkedin.com",
  "GitHub": "https://github.com/Ezana1spu"
},
"Experience": {
  "ExperienceText": "During my time at SPU I have been introduced to a wide variety of computer science languages. This has allowed me to quickly pick up new languages and have a strong foundation in the most popular ones. I have also become familiar with many concepts like data structures and run time.",
  "School": "Seattle Pacific University",
  "Major": "Computer Science",
  "Graduation": "June 2025",
  
  "Employment": "Western Washington University",
  "Role": "Computer Science Lab Assistant",
  
  "Skills": ["C++", " Python", " CSS"," HTML"],
  "AWS": ["Passed the AWS Certification"],
  
  "Resume": "EzanaResume.pdf"  
},
"Project1": {
    "Title": "Threads",
    "Desc": "Making Threads in C.",
    "GitHubRepo": "https://github.com/Ezana1spu/Threads.git",
    "MainImage": "ThreadsMainPhoto.png",
    "DetailImages": []
  },
  "Project2": {
    "Title": "Parking Portal",
    "Desc": "Parking Portal is an application that hopes to provide easy and convenient parking for SPU students. With an app on their phones, students can make an account using their SPU emails and buy parking passes. These passes will allow them to park at any SPU parking lot they want. To better support the user's needs, we allow them to either buy a pass by the hour or buy a pass for the whole day. By allowing students to save their car's license plate and their credit card information they will be able to purchase these passes in a matter of seconds. And on the unfortunate chance they are issued a ticket, our users can pay for it directly on the app. This application has a System Proposal and System Specification completed, which can both be found in Git Hub. The System Proposal gives a complete breakdown of what the application will entail, including any requirements that need to be met in order to build it. The System Specification also gives an overview of the application software layout and includes UI designs for the app.",
    "GitHubRepo": "https://github.com/Ezana1spu/Parking-Portal.git",
    "MainImage": "Project 2.png",
    "DetailImages": []
  }
}
